---
kind: other
id: Methods.T:Autodesk.Revit.DB.LayoutRuleMaximumSpacing
source: html/22763feb-fe9f-dff1-a1f0-846e843ee8a9.htm
---
# LayoutRuleMaximumSpacing Methods

Causes the object to release immediately any resources it may be utilizing.